In [2]:
import pandas as pd

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [5]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [6]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [7]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [8]:
s.name="인구"
s.index.name="도시"

In [9]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [10]:
s/100 #벡터화연산

도시
서울    99043.12
부산    34487.37
인천    28904.51
대구    24660.52
Name: 인구, dtype: float64

In [11]:
s['부산']

3448737

In [15]:
#s[1]
s.iloc[1]

3448737

In [17]:
s
s[[0,3,1]]

C:\Users\박주하\AppData\Local\Temp\ipykernel_15152\4053317522.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [20]:
s.iloc[[0,3,1]]
s[['서울','대구','부산']]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [21]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [22]:
s[['부산', '인천']]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [23]:
s.iloc[[1,2]]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [24]:
s.iloc[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [25]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [26]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [27]:
s['부산':'인천']

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [28]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [29]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [31]:
s.부산
s.인천

2890451

In [33]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [34]:
'부산' in s

True

In [37]:
for k, v in s.items():
    print(k)
    print(v)

서울
9904312
부산
3448737
인천
2890451
대구
2466052

In [38]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [41]:
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
              index=['대전','인천','부산','서울'])
s2

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [40]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s # 2010년도 인구

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [42]:
s2 #2015년 인구

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [43]:
s-s2

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [44]:
# 시리즈 간 연산시 양쪽 모두 자료가 존재하면 계산이 수행
# 어느 한쪽만 자료가 존재하면 NaN(Not a Number)이 나오게 되고, 전체 결과 자료형 또한 float로 변환
ds=s-s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [48]:
s.values
s2.values

array([1490158, 2632035, 3393191, 9631482], dtype=int64)

In [47]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [49]:
s.values-s2.values

array([ 8414154,   816702,  -502740, -7165430], dtype=int64)

In [50]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [51]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [52]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [53]:
s #2010년도 인구

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [54]:
s2 #2015년도 인구

대전    1490158
인천    2632035
부산    3393191
서울    9631482
dtype: int64

In [ ]:
#서울,부산,인천 도시에 대한 인구 감율(%)을 출력하시오.
# 부산    1.636984
# 서울    2.832690
# 인천    9.818107

In [60]:
rs=(s-s2)/s2*100
rs

대구         NaN
대전         NaN
부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

rs.notnull()

In [63]:
rs=rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [65]:
rs['부산']

1.6369841839141974

In [67]:
rs['부산']=1.63

In [68]:
rs['부산']

1.63

In [69]:
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [70]:
del rs['서울']

In [71]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [73]:
obj.array
obj.index

RangeIndex(start=0, stop=4, step=1)

In [74]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [75]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [76]:

obj2["a"]

-5

In [77]:
obj2["d"]=6

In [78]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [79]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [80]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [81]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [82]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [83]:
"b" in obj2

True

In [84]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [85]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [86]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [87]:
pd.Series(sdata)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [90]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [88]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [89]:
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [97]:
obj4.notnull()
obj4.notna()
pd.notnull(obj4)
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [100]:
obj4.isnull()
obj4.isna()
pd.isnull(obj4)
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [101]:

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [102]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [103]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [104]:
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [105]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [106]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [107]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [108]:
pd.Series(data)

state    [Ohio, Ohio, Ohio, Nevada, Nevada, Nevada]
year           [2000, 2001, 2002, 2001, 2002, 2003]
pop                  [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
dtype: object

In [110]:
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [ ]:
# data2 = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
#         "year": [2000, 2001, 2002, 2001, 2002, 2003],
#         "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
# pd.DataFrame(data2)

In [111]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [113]:
frame.head()
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [114]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [115]:
frame=pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [116]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [117]:
pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [118]:

frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [119]:
frame2.index

RangeIndex(start=0, stop=6, step=1)

In [120]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [121]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [122]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [123]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [124]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [125]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [126]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [127]:
#iloc:고유의 행 인덱스 번호를 지정하여 자료를 참조
#loc:행 인덱스 라벨을 지정하여 자료를 참조
frame2
#loc:frame2를 출력했을때 눈에 보이는 행 인덱스 라벨을 지정하여 자료를 참조
#iloc:frame2를 출력했을때 눈에 보이지 않는 고유의 인덱스 번호(0~5번...)를 
#행 인덱스 라벨이라고 함

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [128]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [129]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [130]:
frame2.iloc[-1]

year       2003
state    Nevada
pop         3.2
debt        NaN
Name: 5, dtype: object

In [131]:
frame2.loc[-1]

KeyError: -1

In [132]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [133]:
s.loc['서울']

9904312

In [135]:
s.iloc[0]

9904312

In [136]:
s.iloc[-1]

2466052

In [137]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [138]:
frame2["debt"]

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
Name: debt, dtype: object

In [139]:
#데이터프레임의 특정 행/열을 추출하면 시리즈가 나오게 됨

In [141]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [142]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [143]:
frame2["debt"]=16.5

In [144]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [148]:
import numpy as np

In [149]:
frame2["debt"] = np.arange(6.)

In [150]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [151]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [152]:
type(val)

pandas.core.series.Series

In [153]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [155]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [154]:
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [156]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [157]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [158]:
frame2["state"] == "Ohio"

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [159]:

frame2["eastern"] = frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [160]:
del frame2["eastern"]

In [161]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [162]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [166]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9, 2003:3.1}}

In [167]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},
 'Nevada': {2001: 2.4, 2002: 2.9, 2003: 3.1}}

In [168]:
pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [169]:
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [170]:
frame3.T

        2000  2001  2002  2003
Ohio     1.5   1.7   3.6   NaN
Nevada   NaN   2.4   2.9   3.1

In [171]:
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6},
 'Nevada': {2001: 2.4, 2002: 2.9, 2003: 3.1}}

In [172]:
pd.DataFrame(populations)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [173]:
pd.DataFrame(populations, index=[2001, 2002])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [174]:
pd.DataFrame(populations, index=[2001, 2002,2004])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2004   NaN     NaN

In [175]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [176]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
2003    NaN
Name: Ohio, dtype: float64

In [181]:
frame3['Ohio']
frame3['Ohio'].head(2)
frame3['Ohio'][0:2]
frame3['Ohio'].iloc[[0,1]]
frame3['Ohio'].iloc[0:2]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [186]:
frame3['Ohio'].loc[[2000,2001]]
frame3['Ohio'].loc[2000:2001]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [187]:
frame3['Ohio']

2000    1.5
2001    1.7
2002    3.6
2003    NaN
Name: Ohio, dtype: float64

In [188]:
frame3['Ohio'][:2]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [192]:
frame3['Nevada'][:-2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [193]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [194]:
frame3['Ohio'][:2]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [195]:
frame3['Nevada'][:-2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [196]:
pd.DataFrame({
    'Ohio':frame3['Ohio'][:2],
    'Nevada':frame3['Nevada'][:-2]
})

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [197]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     3.1

In [200]:
frame3.index.name="year"

In [203]:
frame3.columns.name="state"

In [204]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9
2003    NaN     3.1

In [205]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9],
       [nan, 3.1]])

In [206]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [207]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [208]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [209]:
obj

a    0
b    1
c    2
dtype: int32

In [210]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [211]:
index=obj.index

In [213]:
index[1:]

Index(['b', 'c'], dtype='object')

In [217]:
obj2=pd.Series([1.5, -2.5, 0], index=np.arange(1,4))
obj2

1    1.5
2   -2.5
3    0.0
dtype: float64

In [220]:
4 in obj2.index

False

In [221]:
3 in obj2.index

True

In [223]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9
2003    NaN     3.1

In [228]:
2024 in frame3.index
'Utah' in frame3.columns

False

In [230]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [231]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [232]:
obj.reindex(["a", "b", "c", "d", "e"])

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [233]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [234]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [235]:
obj3.reindex(np.arange(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [237]:
#obj3.reindex(np.arange(6), method='ffill') #결측값을 대체할 때 방향을 forward(위->아래) fill
obj3.reindex(np.arange(6), method='bfill') #결측값을 대체할 때 방향을 backward(아래->위) fill

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [238]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [239]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [240]:
states = ["Texas", "Utah", "California"]

In [241]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [242]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [243]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [246]:
frame.loc[['a','d','c']]

   Ohio  Texas  California
a     0      1           2
d     6      7           8
c     3      4           5

In [248]:
frame.loc[['a','d','c'],'California']
frame.loc[['a','d','c'],['California','Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

In [249]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [250]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [251]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [252]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [253]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [254]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [255]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [260]:
#data.drop('two') 에러발생

#data.drop(columns='two')
#data.drop('two', axis=1)
data.drop('two', axis='columns')

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [261]:
data.drop('two', axis='columns', inplace=True)

In [262]:
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [263]:
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [271]:
# obj[1]
# obj[2:4]
obj.iloc[[1,3]]
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [272]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [273]:
obj1

2    1
0    2
1    3
dtype: int64

In [274]:
obj2

a    1
b    2
c    3
dtype: int64

In [278]:
#obj1.iloc[0:3]
obj1.loc[[2,0,1]]

2    1
0    2
1    3
dtype: int64

In [279]:
obj2.loc['b':'c']

b    2
c    3
dtype: int64

In [280]:
obj2.loc['b':'c']=10

In [281]:
obj2

a     1
b    10
c    10
dtype: int64

In [282]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [283]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [284]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [285]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [286]:
data
#three열 값이 5보다 큰 자료를 추출

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [287]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [288]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [289]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [290]:
data[data<5]

          one  two  three  four
Ohio      0.0  1.0    2.0   3.0
Colorado  4.0  NaN    NaN   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [291]:
data[data<5]=0

In [292]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [294]:
#5 6 출력
data[(data == 5) | (data == 6)]

          one  two  three  four
Ohio      NaN  NaN    NaN   NaN
Colorado  NaN  5.0    6.0   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [295]:
data.iloc[1][[1,2]]

C:\Users\박주하\AppData\Local\Temp\ipykernel_15152\3383153149.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data.iloc[1][[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [297]:
data.iloc[1][[1,2]]

C:\Users\박주하\AppData\Local\Temp\ipykernel_15152\3383153149.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data.iloc[1][[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [298]:
data[(data==5) | (data==6)]

          one  two  three  four
Ohio      NaN  NaN    NaN   NaN
Colorado  NaN  5.0    6.0   NaN
Utah      NaN  NaN    NaN   NaN
New York  NaN  NaN    NaN   NaN

In [299]:
data.loc['Colorado'][1:3]

two      5
three    6
Name: Colorado, dtype: int32

In [301]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [302]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [303]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [312]:
data.iloc[[1, 2]]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11

In [314]:
data.iloc[[1, 2],[3,0]]

          four  one
Colorado     7    0
Utah        11    8

In [309]:
data.iloc[2]
data.iloc[2,3]
data.iloc[2,[3,0]]
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [304]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [305]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [315]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [316]:
data[0:3]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [317]:
data.iloc[[0,1,2]]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [318]:
data.iloc[:3]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [319]:
data.loc[['Ohio', 'Colorado', 'Utah']]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [320]:
data.drop('New York')

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [321]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [322]:
data.loc['Ohio':'Utah']

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11

In [324]:
data.loc['Ohio':'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [325]:
data.iloc[:]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [326]:
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [329]:
data.loc['Ohio']

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int32

In [330]:
data.three

Ohio         0
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [331]:
data.three>5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [332]:
data[data.three>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [333]:
data.loc[data.three>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15